driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/NestedRepeatUntil/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://j2ee.netbeans.org/wsdl/Client">
  <soapenv:Body>
    <cli:ClientOperation>
      <part1>a</part1>
      <part2>b</part2>
    </cli:ClientOperation>
  </soapenv:Body>
</soapenv:Envelope>